system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 8 0)
    (0 0 0)
    (2 0 0)
    (2 2 0)
    (2.3 2 0)
    (2.3 0 0)
    (5 0 0)
    (5 2 0)
    (5.3 2 0)
    (5.3 0 0)
    (8 0 0)
    (8 8 0)
    (5.3 8 0)
    (5 8 0)
    (2.3 8 0)
    (2 8 0)

    (0 8 0.1)
    (0 0 0.1)
    (2 0 0.1)
    (2 2 0.1)
    (2.3 2 0.1)
    (2.3 0 0.1)
    (5 0 0.1)
    (5 2 0.1)
    (5.3 2 0.1)
    (5.3 0 0.1)
    (8 0 0.1)
    (8 8 0.1)
    (5.3 8 0.1)
    (5 8 0.1)
    (2.3 8 0.1)
    (2 8 0.1)
    (8 2 0)
    (8 2 0.1)
    (0 2 0)
    (0 2 0.1)

);

blocks
(
    hex (0 34 3 15 16 35 19 31) (50 50 1) simpleGrading (1 1 1)
    hex (34 1 2 3 35 17 18 19) (50 50 1) simpleGrading (1 1 1)
    hex (15 3 4 14 31 19 20 30) (50 50 1) simpleGrading (1 1 1)
    hex (14 4 7 13 30 20 23 29) (50 50 1) simpleGrading (1 1 1)
    hex (4 5 6 7 20 21 22 23) (50 50 1) simpleGrading (1 1 1)
    
    hex (13 7 8 12 29 23 24 28) (50 50 1) simpleGrading (1 1 1)
    hex (12 8 32 11 28 24 33 27) (50 50 1) simpleGrading (1 1 1)
    hex (8 9 10 32 24 25 26 33) (50 50 1) simpleGrading (1 1 1)

    //hex (14 5 6 13 30 21 22 29) (100 100 1) simpleGrading (1 1 1)
    //hex (7 8 12 13 23 24 28 29) (100 100 1) simpleGrading (1 1 1)
    //hex (12 9 10 11 28 25 26 28) (100 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 16 35 34)
            (34 35 17 1)
            (7 6 23 22)
            (3 19 18 2)

        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (8 9 25 24)
            (32 10 26 33)
            (11 32 33 27)
            (4 5 21 20)

        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 17 18 2)
            (3 4 20 19)
            (5 21 22 6)
            (7 23 24 8)
            (9 25 26 10)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (0 15 31 16)
            (15 14 30 31)
            (14 13 29 30)
            (13 12 28 29)
            (12 11 27 28)
            
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
