constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
     water
     {
         transportModel Newtonian;
         nu [0 2 -1 0 0 0 0] 1e-06;
         rho [1 -3 0 0 0 0 0] 1000;
     }

     salt
     {
         transportModel Newtonian;
         nu [0 2 -1 0 0 0 0] 1e-06;
         rho [1 -3 0 0 0 0 0] 1028;
     }


     air
     {
         transportModel Newtonian;
         nu [0 2 -1 0 0 0 0] 1.48e-05;
         rho [1 -3 0 0 0 0 0] 1;
     }
);

sigmas
(
    (air water) 0.07
    (air salt) 0.07
    (water salt) 0.07
);


// ************************************************************************* //
