system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
    volScalarFieldValue alpha.salt 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.8 0.2 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.salt 1
            volScalarFieldValue alpha.air 0
        );
    }
    boxToCell
    {
        box (0 0.2 -1) (0.8 0.6 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue alpha.salt 0
            volScalarFieldValue alpha.air 0
        );
    }
    boxToCell
    {
        box (0 0.6 -1) (0.8 0.8 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.salt 0
            volScalarFieldValue alpha.air 1
        );
    }
);


// ************************************************************************* //
